# Task A
Data preparation
1. Identification & removal of null values;
2. Identification and removal of invalid transaction amount values;
3. Identification of removal of invalid age values;
4. Display the 5 top locations where the maximum number of transactions occurred

In [4]:
# Importing Pandas to read our data, displaying into a dataframe (df) with 100k+ rows and 9 columns

import pandas as pd
df = pd.read_csv('bank_transactions.csv')
print(df)

        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053     10/1/94          F     JAMSHEDPUR
1                  T2   C2142763      4/4/57          M        JHAJJAR
2                  T3   C4417068    26/11/96          F         MUMBAI
3                  T4   C5342380     14/9/73          F         MUMBAI
4                  T5   C9031234     24/3/88          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229      8/4/90          M      NEW DELHI
1048563      T1048564   C6459278     20/2/92          M         NASHIK
1048564      T1048565   C6412354     18/5/89          M      HYDERABAD
1048565      T1048566   C6420483     30/8/78          M  VISAKHAPATNAM
1048566      T1048567   C8337524      5/3/84          M           PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
0                  17819.05          2/8/16           143207
1                   2270.69          2/8/16           141858
2                  17874.44          2/8/16           142712
3                 866503.21          2/8/16           142714
4                   6714.43          2/8/16           181156
...                     ...             ...              ...
1048562             7635.19         18/9/16           184824
1048563            27311.42         18/9/16           183734
1048564           221757.06         18/9/16           183313
1048565            10117.87         18/9/16           184706
1048566            75734.42         18/9/16           181222

         TransactionAmount (INR)
0                           25.0
1                        27999.0
2                          459.0
3                         2060.0
4                         1762.5
...                          ...
1048562                    799.0
1048563                    460.0
1048564                    770.0
1048565                   1000.0
1048566                   1166.0

[1048567 rows x 9 columns]

# A.1

In [5]:
# Identifying how many rows per column have null values using isnull method

df.isnull().sum()

TransactionID                 0
CustomerID                    0
CustomerDOB                3397
CustGender                 1100
CustLocation                151
CustAccountBalance         2369
TransactionDate               0
TransactionTime               0
TransactionAmount (INR)       0
dtype: int64

In [6]:
# Creating a new df called df_clean, using dropna method to remove rows containing null values

df_clean = df.dropna()
print(df_clean)

        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053     10/1/94          F     JAMSHEDPUR
1                  T2   C2142763      4/4/57          M        JHAJJAR
2                  T3   C4417068    26/11/96          F         MUMBAI
3                  T4   C5342380     14/9/73          F         MUMBAI
4                  T5   C9031234     24/3/88          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229      8/4/90          M      NEW DELHI
1048563      T1048564   C6459278     20/2/92          M         NASHIK
1048564      T1048565   C6412354     18/5/89          M      HYDERABAD
1048565      T1048566   C6420483     30/8/78          M  VISAKHAPATNAM
1048566      T1048567   C8337524      5/3/84          M           PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
0                  17819.05          2/8/16           143207
1                   2270.69          2/8/16           141858
2                  17874.44          2/8/16           142712
3                 866503.21          2/8/16           142714
4                   6714.43          2/8/16           181156
...                     ...             ...              ...
1048562             7635.19         18/9/16           184824
1048563            27311.42         18/9/16           183734
1048564           221757.06         18/9/16           183313
1048565            10117.87         18/9/16           184706
1048566            75734.42         18/9/16           181222

         TransactionAmount (INR)
0                           25.0
1                        27999.0
2                          459.0
3                         2060.0
4                         1762.5
...                          ...
1048562                    799.0
1048563                    460.0
1048564                    770.0
1048565                   1000.0
1048566                   1166.0

[1041614 rows x 9 columns]

In [7]:
# Checking new dataframe to see whether rows containing null values has been cleaned

df_clean.isnull()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
1048562,False,False,False,False,False,False,False,False,False
1048563,False,False,False,False,False,False,False,False,False
1048564,False,False,False,False,False,False,False,False,False
1048565,False,False,False,False,False,False,False,False,False
1048566,False,False,False,False,False,False,False,False,False

In [8]:
# Or checking as a summarised overview of the full dataset by adding the .sum() function

df_clean.isnull().sum()

TransactionID              0
CustomerID                 0
CustomerDOB                0
CustGender                 0
CustLocation               0
CustAccountBalance         0
TransactionDate            0
TransactionTime            0
TransactionAmount (INR)    0
dtype: int64

In [9]:
# Benchmark length of df after removing null values
len(df_clean)

1041614

# A.2

In [10]:
# Attempting to remove rows containing transaction amounts of zero (as an integer) (didn't work, same number of rows)

df_clean = df_clean[df_clean['TransactionAmount (INR)'] > 0]
print(df_clean)

        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053     10/1/94          F     JAMSHEDPUR
1                  T2   C2142763      4/4/57          M        JHAJJAR
2                  T3   C4417068    26/11/96          F         MUMBAI
3                  T4   C5342380     14/9/73          F         MUMBAI
4                  T5   C9031234     24/3/88          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229      8/4/90          M      NEW DELHI
1048563      T1048564   C6459278     20/2/92          M         NASHIK
1048564      T1048565   C6412354     18/5/89          M      HYDERABAD
1048565      T1048566   C6420483     30/8/78          M  VISAKHAPATNAM
1048566      T1048567   C8337524      5/3/84          M           PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
0                  17819.05          2/8/16           143207
1                   2270.69          2/8/16           141858
2                  17874.44          2/8/16           142712
3                 866503.21          2/8/16           142714
4                   6714.43          2/8/16           181156
...                     ...             ...              ...
1048562             7635.19         18/9/16           184824
1048563            27311.42         18/9/16           183734
1048564           221757.06         18/9/16           183313
1048565            10117.87         18/9/16           184706
1048566            75734.42         18/9/16           181222

         TransactionAmount (INR)
0                           25.0
1                        27999.0
2                          459.0
3                         2060.0
4                         1762.5
...                          ...
1048562                    799.0
1048563                    460.0
1048564                    770.0
1048565                   1000.0
1048566                   1166.0

[1040794 rows x 9 columns]

In [11]:
# Testing to see whether the row, (T385) containing a zero value under TransactionAmount still exists within the df
print(df_clean[df_clean['TransactionID'] == 'T385'].to_string(index=False))

Empty DataFrame
Columns: [TransactionID, CustomerID, CustomerDOB, CustGender, CustLocation, CustAccountBalance, TransactionDate, TransactionTime, TransactionAmount (INR)]
Index: []

In [12]:
# Attempting to remove rows containing transaction amounts of zero (as a string)

df_stringtest = df_clean[df_clean['TransactionAmount (INR)'] != '0']
print(df_stringtest)

        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053     10/1/94          F     JAMSHEDPUR
1                  T2   C2142763      4/4/57          M        JHAJJAR
2                  T3   C4417068    26/11/96          F         MUMBAI
3                  T4   C5342380     14/9/73          F         MUMBAI
4                  T5   C9031234     24/3/88          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229      8/4/90          M      NEW DELHI
1048563      T1048564   C6459278     20/2/92          M         NASHIK
1048564      T1048565   C6412354     18/5/89          M      HYDERABAD
1048565      T1048566   C6420483     30/8/78          M  VISAKHAPATNAM
1048566      T1048567   C8337524      5/3/84          M           PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
0                  17819.05          2/8/16           143207
1                   2270.69          2/8/16           141858
2                  17874.44          2/8/16           142712
3                 866503.21          2/8/16           142714
4                   6714.43          2/8/16           181156
...                     ...             ...              ...
1048562             7635.19         18/9/16           184824
1048563            27311.42         18/9/16           183734
1048564           221757.06         18/9/16           183313
1048565            10117.87         18/9/16           184706
1048566            75734.42         18/9/16           181222

         TransactionAmount (INR)
0                           25.0
1                        27999.0
2                          459.0
3                         2060.0
4                         1762.5
...                          ...
1048562                    799.0
1048563                    460.0
1048564                    770.0
1048565                   1000.0
1048566                   1166.0

[1040794 rows x 9 columns]

In [13]:
# Testing for type of transaction amount (int/string etc.)

df_clean['TransactionAmount (INR)'].dtype

dtype('float64')

In [14]:
# Testing to see how many transactions of 0.01 there are before cleaning transaction amounts below 0.01
df_clean[df_clean['TransactionAmount (INR)'] == 0.01].sum()

TransactionID              T6313T27163T30260T64413T72242T87999T97070T9819...
CustomerID                 C4319866C2519818C5815789C3425913C5130473C38272...
CustomerDOB                1/12/931/12/9321/3/636/2/9721/8/904/3/845/8/95...
CustGender                                          MMMMMMMMMMFMMMMMMMMMMMMM
CustLocation               MAUMAUMUMBAIPANIPATKARNALCHENNAITHANETHANEARIY...
CustAccountBalance                                                2003967.97
TransactionDate            25/9/1625/9/1625/9/162/8/162/8/161/8/161/8/161...
TransactionTime                                                      2801925
TransactionAmount (INR)                                                 0.24
dtype: object

In [15]:
# Testing to see if values between 0.00 and 0.01 can be removed. (they can)
# df_floattest = df_clean[df_clean['TransactionAmount (INR)'] > 0.01] # - this code also removes transactions of 0.01
df_floattest = df_clean[df_clean['TransactionAmount (INR)'] >= 0.01] # - this code only removes values below 0.01
print(df_floattest)

        TransactionID CustomerID CustomerDOB CustGender   CustLocation  \
0                  T1   C5841053     10/1/94          F     JAMSHEDPUR
1                  T2   C2142763      4/4/57          M        JHAJJAR
2                  T3   C4417068    26/11/96          F         MUMBAI
3                  T4   C5342380     14/9/73          F         MUMBAI
4                  T5   C9031234     24/3/88          F    NAVI MUMBAI
...               ...        ...         ...        ...            ...
1048562      T1048563   C8020229      8/4/90          M      NEW DELHI
1048563      T1048564   C6459278     20/2/92          M         NASHIK
1048564      T1048565   C6412354     18/5/89          M      HYDERABAD
1048565      T1048566   C6420483     30/8/78          M  VISAKHAPATNAM
1048566      T1048567   C8337524      5/3/84          M           PUNE

         CustAccountBalance TransactionDate  TransactionTime  \
0                  17819.05          2/8/16           143207
1                   2270.69          2/8/16           141858
2                  17874.44          2/8/16           142712
3                 866503.21          2/8/16           142714
4                   6714.43          2/8/16           181156
...                     ...             ...              ...
1048562             7635.19         18/9/16           184824
1048563            27311.42         18/9/16           183734
1048564           221757.06         18/9/16           183313
1048565            10117.87         18/9/16           184706
1048566            75734.42         18/9/16           181222

         TransactionAmount (INR)
0                           25.0
1                        27999.0
2                          459.0
3                         2060.0
4                         1762.5
...                          ...
1048562                    799.0
1048563                    460.0
1048564                    770.0
1048565                   1000.0
1048566                   1166.0

[1040794 rows x 9 columns]

In [16]:
# Testing to see whether the row, (T385) containing a zero value under TransactionAmount still exists within the df
print(df_floattest[df_floattest['TransactionID'] == 'T385'].to_string(index=False))

Empty DataFrame
Columns: [TransactionID, CustomerID, CustomerDOB, CustGender, CustLocation, CustAccountBalance, TransactionDate, TransactionTime, TransactionAmount (INR)]
Index: []

In [17]:
# Testing to see how many transactions of 0.01 there are after cleaning transaction amounts below 0.01
df_floattest[df_floattest['TransactionAmount (INR)'] == 0.01].sum()

TransactionID              T6313T27163T30260T64413T72242T87999T97070T9819...
CustomerID                 C4319866C2519818C5815789C3425913C5130473C38272...
CustomerDOB                1/12/931/12/9321/3/636/2/9721/8/904/3/845/8/95...
CustGender                                          MMMMMMMMMMFMMMMMMMMMMMMM
CustLocation               MAUMAUMUMBAIPANIPATKARNALCHENNAITHANETHANEARIY...
CustAccountBalance                                                2003967.97
TransactionDate            25/9/1625/9/1625/9/162/8/162/8/161/8/161/8/161...
TransactionTime                                                      2801925
TransactionAmount (INR)                                                 0.24
dtype: object

In [18]:
# Benchmark length of df_floattest (now called df_clean_trans for cleaned transaction data)
len(df_floattest)

1040794

# A.3

In [19]:
# identification of invalid age values

df_floattest[df_floattest['TransactionID'] == 'T17'] # first example of bad dob

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
16,T17,C1376215,1/1/1800,M,MUMBAI,77495.15,1/8/16,124727,1423.11

In [20]:
# identification of invalid age values cont.

df_ageIdentificationTest = df_floattest[df_floattest['CustomerDOB'] == '1/1/1800']
print(df_ageIdentificationTest)
len(df_floattest) # length pre removal

        TransactionID CustomerID CustomerDOB CustGender  \
16                T17   C1376215    1/1/1800          M
22                T23   C7018081    1/1/1800          M
28                T29   C7935438    1/1/1800          M
35                T36   C1211387    1/1/1800          M
151              T152   C3334638    1/1/1800          M
...               ...        ...         ...        ...
1048443      T1048444   C7261226    1/1/1800          M
1048452      T1048453   C3813481    1/1/1800          M
1048531      T1048532   C6937679    1/1/1800          M
1048533      T1048534   C7431884    1/1/1800          M
1048540      T1048541   C1528025    1/1/1800          M

                     CustLocation  CustAccountBalance TransactionDate  \
16                         MUMBAI            77495.15          1/8/16
22       WAYS PANCHKUVA AHMEDABAD              143.07          3/8/16
28                         MOHALI           969436.12          3/8/16
35                      AHMEDABAD            11791.25          3/8/16
151                          PUNE              700.00          9/8/16
...                           ...                 ...             ...
1048443                    BHILAI             1393.33         18/9/16
1048452                 NEW DELHI           984605.24         18/9/16
1048531                 NEW DELHI            50698.90         18/9/16
1048533            MANDIR DHANBAD            53771.64         18/9/16
1048540                    MUMBAI           230894.59         18/9/16

         TransactionTime  TransactionAmount (INR)
16                124727                  1423.11
22                104718                   110.00
28                183634                    36.90
35                125915                  1075.00
151                24912                  1500.00
...                  ...                      ...
1048443           102427                   200.00
1048452            84644                   219.00
1048531           184319                   598.86
1048533           184049                   520.00
1048540           182331                   290.00

[56180 rows x 9 columns]

1040794

In [21]:
# removal of invalid age values

df_ageRemovalTest = df_floattest[df_floattest['CustomerDOB'] != '1/1/1800']
len(df_ageRemovalTest) # length post removal

984614

#A.4

In [23]:
# get the transaction count per location
# use head() to return the first 5 results already sorted so it is the top 5

df_ageRemovalTest['CustLocation'].value_counts().head()

CustLocation
MUMBAI       97605
BANGALORE    77688
NEW DELHI    76307
GURGAON      70447
DELHI        67263
Name: count, dtype: int64